package com.wanted.common.constants;

public interface NumberStringArray {

    String[] units = {
            "", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
            "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
            "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "одна"
    };

    String[] tens = {
            "", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят",
            "семьдесят", "восемьдесят", "девяносто"
    };

    String[] hundreds = {
            "", "сто", "двести", "триста", "четыреста", "пятьсот",
            "шестьсот", "семьсот", "восемьсот", "девятьсот"
    };

    String[] thousands = {
            "", "одна тысяча", "две тысячи", "три тысячи", "четыре тысячи",
            "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч", "девять тысяч"
    };

    String[] tenThousands = {
            "", "десять", "двадцать", "тридцать",
            "сорок", "пятьдесят", "шестьдесят",
            "семьдесят", "восемьдесят", "девяносто"
    };

}
